Script started on 2021-09-09 11:56:58-04:00 [TERM="xterm-256color" TTY="/dev/pts/9" COLUMNS="80" LINES="24"]
bash: /home/umrigar/cs220/bin/student.rc: No such file or directory
epotapo1@remote00:~/i220a/submit/lab2$ cd exercises/
epotapo1@remote00:~/i220a/submit/lab2/exercises$ cd 1-hello-args/
epotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ ls
hello.c  Makefile  README
epotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ ls -l
total 12
-rw-r----- 1 epotapo1 epotapo1 343 Sep  9 11:49 hello.c
-rw-r----- 1 epotapo1 epotapo1  35 Sep  9 11:49 Makefile
-rw-r----- 1 epotapo1 epotapo1  61 Sep  9 11:49 README
epotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ emacs[K[K[K[K[Kemacs README 
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[24d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[23d[?25l[30m[47m-UUU:----F1  [39;49m[1m[30m[47m*scratch*   [0m[39;49m[30m[47m   All L1     (Fundamental) ---------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[24d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[24;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[24;54H[?25ldone[H
[?12l[?25h[?12;25h[24;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[24;59H[?25ldone[H
[?12l[?25h[?12;25h[24;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[24;58H[?25ldone[H
[?12l[?25h[?12;25h[24;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[24;60H[?25ldone[H
[?12l[?25h[?12;25h[24;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[24;57H[?25ldone[H
[?12l[?25h[?12;25h[24;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[24;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[24;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[24d[?25le[K[H[7mFile Edit Options Buffers Tools Help                                            [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[47m-UUU:----F1  [39;49m[1m[30m[47m*scratch*   [0m[39;49m[30m[47m   All L1     (Fundamental) ---------------------------[39;49m
[A
Loading /var/cache/dictionaries-common/emacsen-ispell-default.el (source)...don\
[A[2d[?12l[?25h[?12;25h[24d[K[A	[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[23;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[23;75H[?25ldone[H
[?12l[?25h[?12;25h[23;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[23;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[23;61H[?25ldone[H
[?12l[?25h[?12;25h[23;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[24d[?25ls.el (source)...[23;10Husr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoload\
[2d[?12l[?25h[?12;25h[24;17H[?25ldone[H
[?12l[?25h[?12;25h[24d[K[23;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[23;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[23;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[23;75H[?25ldone[H
[?12l[?25h[?12;25h[23;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[23;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[23;64H[?25ldone[H
[?12l[?25h[?12;25h[23;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[23;54H[?25ldone[H
[?12l[?25h[?12;25h[23;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[23;65H[?25ldone[H
[?12l[?25h[?12;25h[23;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[23;54H[?25ldone[H
[?12l[?25h[?12;25h[23;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[23;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c[?2004h[?1004h[24d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                           [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction ElDoc) ----------------[39;49m
[A[2d[?12l[?25h[?12;25h[24d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Help                                            [0m[39;49m[27m
[A
Print out a line saying hello to each command-line argument.[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mREADME      [0m[39;49m[30m[48;5;250m   All L1    Git-lab2  (Fundamental) ------------------[39;49m
[A[2d[?12l[?25h[?12;25h[24d[K[2d[24d[K[?1004l[?2004l[?1l>[?12l[?25h[?1049l[23;0;0t[39;49mepotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ make
cc -g -Wall -std=c18    hello.c   -o hello
epotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ ./e[Khello liz za[K[Ksusan
hello liz
hello susan
hello (null)
epotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) 
(gdb) tart[K[K[K[Kstart liz susan
Temporary breakpoint 1 at 0x118b: file hello.c, line 13.
Starting program: /import/linux/home1/epotapo1/projects/i220a/submit/lab2/exercises/1-hello-args/hello liz susan

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe878) at hello.c:13
13	  if (argc == 1) {
(gdb) l
8	}
9	
10	int 
11	main(int argc, const char *argv[])
12	{
13	  if (argc == 1) {
14	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
15	    exit(1);
16	  }
17	  else {
(gdb) 
18	    for (int i = 1; i <= argc; i++) {
19	      say_hello(argv[i]);
20	    }
21	  }
22	  return 0;
23	}
(gdb) b say_hello
Breakpoint 2 at 0x555555555161: file hello.c, line 7.
(gdb) argc
Undefined command: "argc".  Try "help".
(gdb) p argc
$1 = 3
(gdb) p argv
$2 = (const char **) 0x7fffffffe878
(gdb) p argv[0]
$3 = 0x7fffffffead0 "/import/linux/home1/epotapo1/projects/i220a/submit/lab2/exercises/1-hello-args/hello"
(gdb) p argv[1]
$4 = 0x7fffffffeb25 "liz"
(gdb) n
18	    for (int i = 1; i <= argc; i++) {
(gdb) n
19	      say_hello(argv[i]);
(gdb) p i
$5 = 1
(gdb) c
Continuing.

Breakpoint 2, say_hello (name=0x7fffffffeb25 "liz") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) l
2	#include <stdlib.h>
3	
4	static void
5	say_hello(const char *name)
6	{
7	  printf("hello %s\n", name);
8	}
9	
10	int 
11	main(int argc, const char *argv[])
(gdb) p name
$6 = 0x7fffffffeb25 "liz"
(gdb) backtrace
#0  say_hello (name=0x7fffffffeb25 "liz") at hello.c:7
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe878) at hello.c:19
(gdb) print [K[K[K[K[K i
No symbol "i" in current context.
(gdb) up
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe878) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p i
$7 = 1
(gdb) down
#0  say_hello (name=0x7fffffffeb25 "liz") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) c
Continuing.
hello liz

Breakpoint 2, say_hello (name=0x7fffffffeb29 "susan") at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p name
$8 = 0x7fffffffeb29 "susan"
(gdb) c
Continuing.
hello susan

Breakpoint 2, say_hello (name=0x0) at hello.c:7
7	  printf("hello %s\n", name);
(gdb) p name
$9 = 0x0
(gdb) up
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe878) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p i
$10 = 3
(gdb) own[K[K[Kdown
#0  say_hello (name=0x0) at hello.c:7
7	  printf("hello %s\n", name);
(gdb) i[Kup
#1  0x00005555555551e5 in main (argc=3, argv=0x7fffffffe878) at hello.c:19
19	      say_hello(argv[i]);
(gdb) p arg[K[K[Ki
$11 = 3
(gdb) p argc
$12 = 3
(gdb) q
A debugging session is active.

	Inferior 1 [process 221109] will be killed.

Quit anyway? (y or n) y
epotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ ls
hello  hello.c	Makefile  README
epotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ emacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[24d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[23d[?25l[30m[47m-UUU:----F1  [39;49m[1m[30m[47m*scratch*   [0m[39;49m[30m[47m   All L1     (Fundamental) ---------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[24d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[24;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[24;54H[?25ldone[H
[?12l[?25h[?12;25h[24;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[24;59H[?25ldone[H
[?12l[?25h[?12;25h[24;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[24;58H[?25ldone[H
[?12l[?25h[?12;25h[24;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[24;60H[?25ldone[H
[?12l[?25h[?12;25h[24;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[24;57H[?25ldone[H
[?12l[?25h[?12;25h[24;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[24;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[24;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[24d[?25le[K[H[7mFile Edit Options Buffers Tools Help                                            [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[47m-UUU:----F1  [39;49m[1m[30m[47m*scratch*   [0m[39;49m[30m[47m   All L1     (Fundamental) ---------------------------[39;49m
[A
Loading /var/cache/dictionaries-common/emacsen-ispell-default.el (source)...don\
[A[2d[?12l[?25h[?12;25h[24d[K[A	[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[23;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[23;75H[?25ldone[H
[?12l[?25h[?12;25h[23;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[23;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[23;61H[?25ldone[H
[?12l[?25h[?12;25h[23;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[24d[?25ls.el (source)...[23;10Husr/share/emacs/site-lisp/elpa/haskell-mode-16.1/haskell-mode-autoload\
[2d[?12l[?25h[?12;25h[24;17H[?25ldone[H
[?12l[?25h[?12;25h[24d[K[23;10H[?25letc/emacs/site-start.d/50haskell-mode.el (source)...done[K[H
[?12l[?25h[?12;25h[23;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[23;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[23;75H[?25ldone[H
[?12l[?25h[?12;25h[23;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[23;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[23;64H[?25ldone[H
[?12l[?25h[?12;25h[23;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[23;54H[?25ldone[H
[?12l[?25h[?12;25h[23;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[23;65H[?25ldone[H
[?12l[?25h[?12;25h[23;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[23;54H[?25ldone[H
[?12l[?25h[?12;25h[23;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[23;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c[?2004h[?1004h[24d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools Lisp-Interaction Help                           [0m[39;49m[27m
[A
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[K
[30m[48;5;250m-UUU:----F1  [39;49m[1m[30m[48;5;250m*scratch*   [0m[39;49m[30m[48;5;250m   All L1     (Lisp Interaction ElDoc) ----------------[39;49m
[A[2d[?12l[?25h[?12;25h[24d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                          [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
    fprintf(stderr, [38;5;89m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [38;5;129melse[39;49m {[K
    [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 1; i <= argc; i++) {[K
      say_hello(argv[i]);[K
    }[K
  }[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ------------------[39;49m
[A[2d[?12l[?25h[?12;25h[24d[K[23;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[23;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[23;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[23;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[23;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[23;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[23;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[23;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[23;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[23;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[23;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[23;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[23;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[23;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[23;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[23;35H[?25l[30m[48;5;250m7[39;49m[18;1H[?12l[?25h[?12;25h[23;35H[?25l[30m[48;5;250m8[39;49m[19;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[?25l[1P[23;6H[30m[48;5;250m**[39;49m[19;24H[?12l[?25h[?12;25h




[?25lSaving file /home/epotapo1/i220a/submit/lab2/exercises/1-hello-args/hello.c...[19;24H[?12l[?25h[?12;25h




[?25lWrote /home/epotapo1/i220a/submit/lab2/exercises/1-hello-args/hello.c[K[19;24H[?12l[?25h[?12;25h[23;6H[?25l[30m[48;5;250m----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L18   Git:[39;49m[19;24H[?12l[?25h[?12;25h




[K[19;24H




[K[?1004l[?2004l[?1l>[?12l[?25h[?1049l[23;0;0t[39;49mepotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ make
cc -g -Wall -std=c18    hello.c   -o hello
epotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ ./hello liz susan
hello liz
hello susan
epotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ m[Kcat u[Khello.c
#include <stdio.h>
#include <stdlib.h>

static void
say_hello(const char *name)
{
  printf("hello %s\n", name);
}

int 
main(int argc, const char *argv[])
{
  if (argc == 1) {
    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
    exit(1);
  }
  else {
    for (int i = 1; i < argc; i++) {
      say_hello(argv[i]);
    }
  }
  return 0;
}
epotapo1@remote00:~/i220a/submit/lab2/exercises/1-hello-args$ cd ..
epotapo1@remote00:~/i220a/submit/lab2/exercises$ cd 2-hello-upcase-args/
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ [Kepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ lss[K -l
total 12
-rw-r----- 1 epotapo1 epotapo1 962 Sep  9 11:49 hello.c
-rw-r----- 1 epotapo1 epotapo1  35 Sep  9 11:49 Makefile
-rw-r----- 1 epotapo1 epotapo1 161 Sep  9 11:49 README
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'liz potapova' 'usan[K[K[K[Ksusan [K[K[K[K[K[Kus[K[Ksusan susam[Kn'
bash: ./hello: No such file or directory
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ mae[Kke
cc -g -Wall -std=c18    hello.c   -o hello
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ make./hello 'liz potapova' 'susan susan'
Hello Liz PotapovaU
Hello Susan SusanîU
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'liz potapova' 'susan susan'[K./hello liz susan
Hello Liz
Hello Susan
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello liz susan'liz potapova' 'susan susan'[1P[1P[1P[1@L[1@I[1@Z[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[C[1P'[1P'[1P'[1P'[1P'S'U'S'A'N'
Hello LIZ PotapovasU
Hello Susan SUSAN˜sU
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ gdb hello[K[K[K[K[K[K[K[K[Kemacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[26d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[25d[?25l[30m[47m-UUU:----F1  [39;49m[1m[30m[47m*scratch*   [0m[39;49m[30m[47m   All L1     (Fundamental) ------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[26d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[26;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[26;54H[?25ldone[H
[?12l[?25h[?12;25h[26;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[26;59H[?25ldone[H
[?12l[?25h[?12;25h[26;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[26;58H[?25ldone[H
[?12l[?25h[?12;25h[26;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[26;60H[?25ldone[H
[?12l[?25h[?12;25h[26;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[26;57H[?25ldone[H
[?12l[?25h[?12;25h[26;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[26;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[26;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[26;77H[?25ldone[H
[?12l[?25h[?12;25h[26;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[26;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[26;75H[?25ldone[H
[?12l[?25h[?12;25h[26;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[26;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[26;61H[?25ldone[H
[?12l[?25h[?12;25h[26;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[26;10H[?25lusr/share/emacs/site-lisp/elpa/haskel[34@l-mode-16.1/haskell-mode-autoloads[H
[?12l[?25h[?12;25h[26;96H[?25ldone[H
[?12l[?25h[?12;25h[26;10H[?25letc/emacs/site-start.d/50haskell-mode[34P[H
[?12l[?25h[?12;25h[26;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[26;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[26;75H[?25ldone[H
[?12l[?25h[?12;25h[26;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[26;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[26;64H[?25ldone[H
[?12l[?25h[?12;25h[26;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[26;54H[?25ldone[H
[?12l[?25h[?12;25h[26;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[26;65H[?25ldone[H
[?12l[?25h[?12;25h[26;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[26;54H[?25ldone[H
[?12l[?25h[?12;25h[26;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[26;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c[?2004h[?1004h[26d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[26d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                 [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                       
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                   
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                             
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ---------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[27d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                 [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                       
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                   
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                             
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ---------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                 [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                       
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                   
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                             
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ---------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[28d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                  [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                        
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                    
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                              
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ----------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[29d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                  [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                        
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                    
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                              
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ----------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[30d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                  [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                        
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                    
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                              
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ----------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[31d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                   [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                         
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                     
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                               
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) -----------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[32d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                   [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                         
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                     
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                               
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) -----------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[33d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                   [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                         
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                     
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                               
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) -----------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[34d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                   [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                         
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                     
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                               
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) -----------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[34d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                    [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                          
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                      
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[35d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                    [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                          
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                      
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[36d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                     [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                           
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                       
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                 
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) -------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[37d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                     [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                           
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                       
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                 
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) -------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[37d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                      [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                            
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                        
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                  
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) --------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                      [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                            
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                        
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                  
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) --------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                       [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                             
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                         
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                   
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ---------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                        [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                              
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                          
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                    
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ----------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                         [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                               
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                           
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                     
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) -----------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                          [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                            
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                      
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                           [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                 
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                             
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                       
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) -------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                            [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                  
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                              
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                        
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) --------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                             [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                   
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                               
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                         
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ---------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                              [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                    
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                                
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                          
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) ----------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[H[2J[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                               [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                     
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                                 
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                           
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) -----------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[38d[K[37;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[18;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[19;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[20;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m20[39;49m[21;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[22;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[23;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[25;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[28;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[29;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[30;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m30[39;49m[31;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[32;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[33;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[34;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[35;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[A[?12l[?25h[?12;25h[1;36r[2;1H[18M[1;38r[19;1H[?25l    fprintf(stderr, [38;5;89m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [38;5;129melse[39;49m {[K
    [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 1; i < argc; i++) {[K
      [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m = argv[i];[K
      [38;5;28mchar[39;49m [38;5;130mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [38;5;129mreturn[39;49m 0;[K
}[K
[K
[K
[K
[K
[K[37;29H[30m[48;5;250mBot L36[39;49m[19;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[20;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[22;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m40[39;49m[23;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[24;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[25;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[27;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[28;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[29;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[30;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[31;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[32;1H[?12l[?25h[?12;25h[38d[?25lEnd of buffer[32;1H[?12l[?25h[?12;25h[38d[K[37;35H[?25l[30m[48;5;250m8[39;49m[31;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[30;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[29;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[28;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[27;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[26;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[25;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[24;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m0[39;49m[23;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m39[39;49m[22;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[21;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[20;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[19;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[18;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[17;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[16;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[15;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[14;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m0[39;49m[13;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m29[39;49m[12;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[11;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[10;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[9;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[8;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[7;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[6;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[5;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[4;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m0[39;49m[H

[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m19[39;49m[H
[?12l[?25h[?12;25h[1;36r[2;1H[18L[1;38r[2;1H[?25l[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                     
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                                 
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                           
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K[37;29H[30m[48;5;250mTop L18[39;49m[19;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[18;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m0[39;49m[11;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m9 [39;49m[10;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m1[39;49m[H
[?12l[?25h[?12;25h[38d[?25lBeginning of buffer[H
[?12l[?25h[?12;25h[38d[K[37;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[18;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[19;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[20;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m20[39;49m[21;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[22;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[23;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[24;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[25;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[26;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[27;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[28;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[29;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[30;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m30[39;49m[31;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[32;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[33;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[34;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[35;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[A[?12l[?25h[?12;25h[1;36r[2;1H[18M[1;38r[19;1H[?25l    fprintf(stderr, [38;5;89m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [38;5;129melse[39;49m {[K
    [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 1; i < argc; i++) {[K
      [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m = argv[i];[K
      [38;5;28mchar[39;49m [38;5;130mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [38;5;129mreturn[39;49m 0;[K
}[K
[K
[K
[K
[K
[K[37;29H[30m[48;5;250mBot L36[39;49m[19;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[20;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[21;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[22;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m40[39;49m[23;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m39[39;49m[22;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[21;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[20;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[17;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[15;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m0[39;49m[13;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m28[39;49m[11;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[8;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[7;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[6;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[5;1H[?12l[?25h[?12;25h[1;36r[2;1H[18L[1;38r[2;1H[?25l[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                     
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                                 
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                           
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K[37;29H[30m[48;5;250mTop L17[39;49m[18;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m9 [39;49m[10;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[38d[?25lBeginning of buffer[37;34H[30m[48;5;250m1[39;49m[H
[?12l[?25h[?12;25h[38d[K[2d[38d[K[?1004l[?2004l[?1l>[?12l[?25h[?1049l[23;0;0t[39;49mepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start 'liz potapova' 'susan susan[K[K[K[Kmellypants'
Temporary breakpoint 1 at 0x12be: file hello.c, line 35.
Starting program: /import/linux/home1/epotapo1/projects/i220a/submit/lab2/exercises/2-hello-upcase-args/hello 'liz potapova' 'susan smellypants'

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe848) at hello.c:35
35	  if (argc == 1) {
(gdb) l
30	}
31	
32	int
33	main(int argc, const char *argv[])
34	{
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
(gdb) 
40	    for (int i = 1; i < argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
47	  return 0;
48	}
(gdb) b upcase)[K-[K_words
Breakpoint 2 at 0x555555555195: file hello.c, line 13.
(gdb) c
Continuing.

Breakpoint 2, upcase_words (in=0x7fffffffeb01 "liz potapova", out=0x7fffffffe6f0 "\001") at hello.c:13
13	  int inWord = 0;
(gdb) l
8	 *  has enough space for the strlen(in) characters of in.
9	 */
10	void
11	upcase_words(const char in[], char out[])
12	{
13	  int inWord = 0;
14	  int n = strlen(in);
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && isalpha(in[i])) {
17	      out[i] = toupper(in[i]);
(gdb) p in
$1 = 0x7fffffffeb01 "liz potapova"
(gdb) p out
$2 = 0x7fffffffe6f0 "\001"
(gdb) l
18	    }
19	    else {
20	      out[i] = in[i];
21	    }
22	    inWord = isalpha(in[i]);
23	  }
24	}
25	
26	static void
27	say_hello(const char *name)
(gdb) b 17
Breakpoint 3 at 0x5555555551ee: file hello.c, line 17.
(gdb) c
Continuing.

Breakpoint 3, upcase_words (in=0x7fffffffeb01 "liz potapova", out=0x7fffffffe6f0 "\001") at hello.c:17
17	      out[i] = toupper(in[i]);
(gdb) l
12	{
13	  int inWord = 0;
14	  int n = strlen(in);
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && isalpha(in[i])) {
17	      out[i] = toupper(in[i]);
18	    }
19	    else {
20	      out[i] = in[i];
21	    }
(gdb) p i
$3 = 0
(gdb) p n
$4 = 12
(gdb) p in
$5 = 0x7fffffffeb01 "liz potapova"
(gdb) p in[i]
$6 = 108 'l'
(gdb) c
Continuing.

Breakpoint 3, upcase_words (in=0x7fffffffeb01 "liz potapova", out=0x7fffffffe6f0 "Liz ") at hello.c:17
17	      out[i] = toupper(in[i]);
(gdb) p i
$7 = 4
(gdb) p in[i]
$8 = 112 'p'
(gdb) c
Continuing.
Hello Liz PotapovaUU

Breakpoint 2, upcase_words (in=0x7fffffffeb0e "susan smellypants", out=0x7fffffffe6e0 "`\347\377\377\377\177") at hello.c:13
13	  int inWord = 0;
(gdb) p n
$9 = 0
(gdb) c
Continuing.

Breakpoint 3, upcase_words (in=0x7fffffffeb0e "susan smellypants", out=0x7fffffffe6e0 "`\347\377\377\377\177") at hello.c:17
17	      out[i] = toupper(in[i]);
(gdb) p n
$10 = 17
(gdb) p in
$11 = 0x7fffffffeb0e "susan smellypants"
(gdb) p in[17]
$12 = 0 '\000'
(gdb) q
A debugging session is active.

	Inferior 1 [process 229839] will be killed.

Quit anyway? (y or n) y
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[38d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[37d[?25l[30m[47m-UUU:----F1  [39;49m[1m[30m[47m*scratch*   [0m[39;49m[30m[47m   All L1     (Fundamental) --------------------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[38d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[38;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[38;54H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[38;59H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[38;58H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[38;60H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[38;57H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[38;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[38;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[38;77H[?25ldone[H
[?12l[?25h[?12;25h[38;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[38;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[38;75H[?25ldone[H
[?12l[?25h[?12;25h[38;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[38;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[38;61H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[38;10H[?25lusr/share/emacs/site-lisp/elpa/haskel[34@l-mode-16.1/haskell-mode-autoloads[H
[?12l[?25h[?12;25h[38;96H[?25ldone[H
[?12l[?25h[?12;25h[38;10H[?25letc/emacs/site-start.d/50haskell-mode[34P[H
[?12l[?25h[?12;25h[38;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[38;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[38;75H[?25ldone[H
[?12l[?25h[?12;25h[38;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[38;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[38;64H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[38;54H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[38;65H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[38;54H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[38;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c[?2004h[?1004h[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                               [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                     
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                                 
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                           
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in);[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git-lab2  (C/*l Abbrev) -----------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[38d[K[37;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[?25l-;[37;6H[30m[48;5;250m**[39;49m[15;22H[?12l[?25h[?12;25h[?25l1;[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[16;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[17;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[16;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[15;23H[?12l[?25h[?12;25h[?25l -1;[?12l[?25h[?12;25h[C[?25l 1;[?12l[?25h[?12;25h[38;1H[?25lSaving file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c...[15;24H[?12l[?25h[?12;25h[38;1H[?25lWrote /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[15;24H[?12l[?25h[?12;25h[37;6H[?25l[30m[48;5;250m----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L14   Git:[39;49m[15;24H[?12l[?25h[?12;25h[38;1H[K[37;35H[?25l[30m[48;5;250m5[39;49m[16;24H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[17;24H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[18;24H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[19;6H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[20;11H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m20[39;49m[21;22H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[22;6H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[23;24H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[24;4H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[25;2H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[26;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[27;12H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[28;24H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[29;2H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[30;24H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m30[39;49m[31;2H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[32;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[33;4H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[34;24H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[35;2H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[36;19H[?12l[?25h[?12;25h[1;36r[2;1H[18M[1;38r[19;1H[?25l    fprintf(stderr, [38;5;89m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [38;5;129melse[39;49m {[K
    [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 1; i < argc; i++) {[K
      [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m = argv[i];[K
      [38;5;28mchar[39;49m [38;5;130mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [38;5;129mreturn[39;49m 0;[K
}[K
[K
[K
[K
[K
[K[37;29H[30m[48;5;250mBot L36[39;49m[19;24H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[20;13H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[21;4H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[22;9H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m40[39;49m[23;24H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[24;24H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[25;24H[?12l[?25h[?12;25h	[C[C[C[C[C[C		[C[C[C[C[?25l ];[37;6H[30m[48;5;250m**[39;49m[25;38H[?12l[?25h[?12;25h[?25l-];[?12l[?25h[?12;25h[?25l ];[?12l[?25h[?12;25h[?25l1];[?12l[?25h[?12;25h[38;1H[?25lSaving file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c...[25;41H[?12l[?25h[?12;25h[38;1H[?25lWrote /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[25;41H[?12l[?25h[?12;25h[37;6H[?25l[30m[48;5;250m--[39;49m[25;41H[?12l[?25h[?12;25h[38;1H[K[25;41H[38;1H[K[?1004l[?2004l[?1l>[?12l[?25h[?1049l[23;0;0t[39;49mepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ make
cc -g -Wall -std=c18    hello.c   -o hello
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello [K[K[K[K[K[K[K[Kmakeemacs hello.c[4Pgdb helloemacs hello.c./hello 'LIZ potapova' 'susan SUSAN'liz susan[K'liz potapova' 'susan susan'
Hello Liz PotapovV
Hello Susan Susa‹V
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[38d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[37d[?25l[30m[47m-UUU:----F1  [39;49m[1m[30m[47m*scratch*   [0m[39;49m[30m[47m   All L1     (Fundamental) --------------------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[38d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[38;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[38;54H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[38;59H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[38;58H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[38;60H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[38;57H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[38;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[38;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[38;77H[?25ldone[H
[?12l[?25h[?12;25h[38;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[38;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[38;75H[?25ldone[H
[?12l[?25h[?12;25h[38;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[38;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[38;61H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[38;10H[?25lusr/share/emacs/site-lisp/elpa/haskel[34@l-mode-16.1/haskell-mode-autoloads[H
[?12l[?25h[?12;25h[38;96H[?25ldone[H
[?12l[?25h[?12;25h[38;10H[?25letc/emacs/site-start.d/50haskell-mode[34P[H
[?12l[?25h[?12;25h[38;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[38;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[38;75H[?25ldone[H
[?12l[?25h[?12;25h[38;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[38;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[38;64H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[38;54H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[38;65H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[38;54H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[38;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c[?2004h[?1004h[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                               [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                     
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                                 
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                           
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in) - 1;[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git:lab2  (C/*l Abbrev) -----------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[38d[K[37;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[16;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[17;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[18;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[19;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[20;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m20[39;49m[21;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[22;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[23;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[24;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[25;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[26;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[27;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[28;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[29;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[30;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m30[39;49m[31;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[32;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[33;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[34;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[35;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[A[?12l[?25h[?12;25h[1;36r[2;1H[18M[1;38r[19;1H[?25l    fprintf(stderr, [38;5;89m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [38;5;129melse[39;49m {[K
    [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 1; i < argc; i++) {[K
      [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m = argv[i];[K
      [38;5;28mchar[39;49m [38;5;130mfriendlyName[39;49m[strlen(name) - 1];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [38;5;129mreturn[39;49m 0;[K
}[K
[K
[K
[K
[K
[K[37;29H[30m[48;5;250mBot L36[39;49m[19;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[20;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[21;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[22;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m40[39;49m[23;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[24;1H[?12l[?25h[?12;25h[C[C[C[C[37;35H[?25l[30m[48;5;250m2[39;49m[25;5H[?12l[?25h[?12;25h[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C		[?25l];[K[37;6H[30m[48;5;250m**[39;49m[25;40H[?12l[?25h[?12;25h[?25l];[K[?12l[?25h[?12;25h[?25l];[K[?12l[?25h[?12;25h[?25l];[K[?12l[?25h[?12;25h[38;1H[?25lSaving file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c...[25;37H[?12l[?25h[?12;25h[38;1H[?25lWrote /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[25;37H[?12l[?25h[?12;25h[37;6H[?25l[30m[48;5;250m--[39;49m[25;37H[?12l[?25h[?12;25h[38;1H[K[25;37H[38;1H[K[?1004l[?2004l[?1l>[?12l[?25h[?1049l[23;0;0t[39;49mepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ make
cc -g -Wall -std=c18    hello.c   -o hello
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.c./hello 'liz potapova' 'susan susan'
Hello Liz PotapovðU
Hello Susan Susa}ðU
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ gdb hello
GNU gdb (Debian 8.2.1-2+b3) 8.2.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type "show copying" and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
    <http://www.gnu.org/software/gdb/documentation/>.

For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from hello...done.
(gdb) start 'liz potapova' 'susan smellypants'
Temporary breakpoint 1 at 0x12c1: file hello.c, line 35.
Starting program: /import/linux/home1/epotapo1/projects/i220a/submit/lab2/exercises/2-hello-upcase-args/hello 'liz potapova' 'susan smellypants'

Temporary breakpoint 1, main (argc=3, argv=0x7fffffffe848) at hello.c:35
35	  if (argc == 1) {
(gdb) l
30	}
31	
32	int
33	main(int argc, const char *argv[])
34	{
35	  if (argc == 1) {
36	    fprintf(stderr, "usage: %s NAME...\n", argv[0]);
37	    exit(1);
38	  }
39	  else {
(gdb) p argc
$1 = 3
(gdb) p arg[1]
cannot subscript requested type
(gdb) p argv[1]
$2 = 0x7fffffffeb01 "liz potapova"
(gdb) l
40	    for (int i = 1; i < argc; i++) {
41	      const char *name = argv[i];
42	      char friendlyName[strlen(name)];
43	      upcase_words(name, friendlyName);
44	      say_hello(friendlyName);
45	    }
46	  }
47	  return 0;
48	}
(gdb) b upcase_words
Breakpoint 2 at 0x555555555195: file hello.c, line 13.
(gdb) c
Continuing.

Breakpoint 2, upcase_words (in=0x7fffffffeb01 "liz potapova", out=0x7fffffffe6f0 "\001") at hello.c:13
13	  int inWord = 0;
(gdb) up
#1  0x0000555555555387 in main (argc=3, argv=0x7fffffffe848) at hello.c:43
43	      upcase_words(name, friendlyName);
(gdb) p name
$3 = 0x7fffffffeb01 "liz potapova"
(gdb) p friendlg[K[KlyName
$4 = "\001\000\000\000\000\000\000\000,SUU"
(gdb) p len[name]
No symbol "len" in current context.
(gdb) strlen{name}
Undefined command: "strlen".  Try "help".
(gdb) strlen{[K(name)
Undefined command: "strlen".  Try "help".
(gdb) up
Initial frame selected; you cannot go up.
(gdb) down
#0  upcase_words (in=0x7fffffffeb01 "liz potapova", out=0x7fffffffe6f0 "\001") at hello.c:13
13	  int inWord = 0;
(gdb) l
8	 *  has enough space for the strlen(in) characters of in.
9	 */
10	void
11	upcase_words(const char in[], char out[])
12	{
13	  int inWord = 0;
14	  int n = strlen(in) - 1;
15	  for (int i = 0; i < n; i++) {
16	    if (!inWord && isalpha(in[i])) {
17	      out[i] = toupper(in[i]);
(gdb) l[Kp in
$5 = 0x7fffffffeb01 "liz potapova"
(gdb) p n
$6 = 0
(gdb) q
A debugging session is active.

	Inferior 1 [process 233506] will be killed.

Quit anyway? (y or n) y
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ emacs hello.c
[?1049h[22;0;0t[?12;25h[?1h=[H[2J[38d[K[?1l>[?12l[?25h[?1049l[23;0;0t[39;49m[?1049h[22;0;0t[?12;25h[?1h=[H[2J[37d[?25l[30m[47m-UUU:----F1  [39;49m[1m[30m[47m*scratch*   [0m[39;49m[30m[47m   All L1     (Fundamental) --------------------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[38d[?25lLoading /etc/emacs/site-start.d/00debian.el (source)...done[K[H
[?12l[?25h[?12;25h[38;33H[?25l50a2ps.el (source)...[K[H
[?12l[?25h[?12;25h[38;54H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lsymptote.el (source)...[H
[?12l[?25h[?12;25h[38;59H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lutoconf.el (source)...[K[H
[?12l[?25h[?12;25h[38;58H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25lcmake-data.el (source)...[K[H
[?12l[?25h[?12;25h[38;60H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25ldevhelp.el (source)...[K[H
[?12l[?25h[?12;25h[38;57H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lictionaries-common.el (source)...[H
[?12l[?25h[?12;25h[38;9H[?25ldebian-ispell...[K[H
[?12l[?25h[?12;25h[38;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-default.el (source)...[H
[?12l[?25h[?12;25h[38;77H[?25ldone[H
[?12l[?25h[?12;25h[38;9H[?25ldebian-ispell...done[K[H
[?12l[?25h[?12;25h[38;9H[?25l/var/cache/dictionaries-common/emacsen-ispell-dicts.el (source)...[H
[?12l[?25h[?12;25h[38;75H[?25ldone[H
[?12l[?25h[?12;25h[38;10H[?25letc/emacs/site-start.d/50dictionaries-common[6P[H
[?12l[?25h[?12;25h[38;35H[?25lerlang-mode.el (source)...[K[H
[?12l[?25h[?12;25h[38;61H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25lhaskell-mode.el (source)...[K[H
[?12l[?25h[?12;25h[38;10H[?25lusr/share/emacs/site-lisp/elpa/haskel[34@l-mode-16.1/haskell-mode-autoloads[H
[?12l[?25h[?12;25h[38;96H[?25ldone[H
[?12l[?25h[?12;25h[38;10H[?25letc/emacs/site-start.d/50haskell-mode[34P[H
[?12l[?25h[?12;25h[38;35H[?25llatex-cjk-common.el (source)...[H
[?12l[?25h[?12;25h[38;10H[?25lusr/share/emacs/site-lisp/latex-cjk-commo[9@n/cjk-enc[H
[?12l[?25h[?12;25h[38;75H[?25ldone[H
[?12l[?25h[?12;25h[38;10H[?25letc/emacs/site-start.d/50latex-cjk-common[9P[H
[?12l[?25h[?12;25h[38;45H[?25lthai.el (source)...[K[H
[?12l[?25h[?12;25h[38;64H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25lpsvn.el (source)...[K[H
[?12l[?25h[?12;25h[38;54H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lython-docutils.el (source)...[H
[?12l[?25h[?12;25h[38;65H[?25ldone[H
[?12l[?25h[?12;25h[38;35H[?25ltcsh.el (source)...[K[H
[?12l[?25h[?12;25h[38;54H[?25ldone[H
[?12l[?25h[?12;25h[38;36H[?25lexlive-lang-english.el (source)...[H
[?12l[?25h[?12;25h[38;70H[?25ldone[H
[?12l[?25h[?12;25h[>0c[?2004h[?1004h[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H
[?12l[?25h[?12;25h[38d[?25lFor information about GNU Emacs and the GNU system, type C-h C-a.[K[H[7mFile Edit Options Buffers Tools C Help                                                                                               [0m[39;49m[27m
[A
[38;5;60m#include[39;49m [38;5;89m<ctype.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdio.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<stdlib.h>[39;49m[K
[38;5;60m#include[39;49m [38;5;89m<string.h>[39;49m[K
[K
[38;5;89m/** Upcase the initial letter of each word from in, copying the [39;49m                                                                     
[A
[38;5;89m *  results into out.  The caller is responsible to ensure that out [39;49m                                                                 
[A
[38;5;89m *  has enough space for the strlen(in) characters of in. [39;49m                                                                           
[A
[38;5;89m */[39;49m[K
[38;5;28mvoid[39;49m[K
[38;5;21mupcase_words[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m [38;5;130min[39;49m[], [38;5;28mchar[39;49m [38;5;130mout[39;49m[])[K
{[K
  [38;5;28mint[39;49m [38;5;130minWord[39;49m = 0;[K
  [38;5;28mint[39;49m [38;5;130mn[39;49m = strlen(in) - 1;[K
  [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 0; i < n; i++) {[K
    [38;5;129mif[39;49m (!inWord && isalpha(in[i])) {[K
      out[i] = toupper(in[i]);[K
    }[K
    [38;5;129melse[39;49m {[K
      out[i] = in[i];[K
    }[K
    inWord = isalpha(in[i]);[K
  }[K
}[K
[K
[38;5;129mstatic[39;49m [38;5;28mvoid[39;49m[K
[38;5;21msay_hello[39;49m([38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m)[K
{[K
  printf([38;5;89m"Hello %s\n"[39;49m, name);[K
}[K
[K
[38;5;28mint[39;49m[K
[38;5;21mmain[39;49m([38;5;28mint[39;49m [38;5;130margc[39;49m, [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130margv[39;49m[])[K
{[K
  [38;5;129mif[39;49m (argc == 1) {[K
[30m[48;5;250m-UU-:----F1  [39;49m[1m[30m[48;5;250mhello.c     [0m[39;49m[30m[48;5;250m   Top L1    Git:lab2  (C/*l Abbrev) -----------------------------------------------------------------------[39;49m
[A[2d[?12l[?25h[?12;25h[38d[K[37;34H[?25l[30m[48;5;250m2[39;49m[H

[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m3[39;49m[4;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m4[39;49m[5;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m5[39;49m[6;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m6[39;49m[7;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m7[39;49m[8;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m8[39;49m[9;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m9[39;49m[10;1H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m10[39;49m[11;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[12;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[13;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[14;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[15;1H[?12l[?25h[?12;25h[C[C[C[C[C[C		[C[C[C[C[C[C		[C[C[C[C[C[C[?25l 1;[K[37;6H[30m[48;5;250m**[39;49m[15;22H[?12l[?25h[?12;25h[?25l+ 1;[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[16;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[17;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[18;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[19;6H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[20;11H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m20[39;49m[21;22H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[22;6H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[23;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[24;4H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[25;2H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[26;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m6[39;49m[27;12H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[28;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[29;2H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[30;23H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m30[39;49m[31;2H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[32;1H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[33;4H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m3[39;49m[34;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m4[39;49m[35;2H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m5[39;49m[36;19H[?12l[?25h[?12;25h[1;36r[2;1H[18M[1;38r[19;1H[?25l    fprintf(stderr, [38;5;89m"usage: %s NAME...\n"[39;49m, argv[0]);[K
    exit(1);[K
  }[K
  [38;5;129melse[39;49m {[K
    [38;5;129mfor[39;49m ([38;5;28mint[39;49m [38;5;130mi[39;49m = 1; i < argc; i++) {[K
      [38;5;129mconst[39;49m [38;5;28mchar[39;49m *[38;5;130mname[39;49m = argv[i];[K
      [38;5;28mchar[39;49m [38;5;130mfriendlyName[39;49m[strlen(name)];[K
      upcase_words(name, friendlyName);[K
      say_hello(friendlyName);[K
    }[K
  }[K
  [38;5;129mreturn[39;49m 0;[K
}[K
[K
[K
[K
[K
[K[37;29H[30m[48;5;250mBot L36[39;49m[19;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m7[39;49m[20;13H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m8[39;49m[21;4H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m9[39;49m[22;9H[?12l[?25h[?12;25h[37;34H[?25l[30m[48;5;250m40[39;49m[23;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m1[39;49m[24;23H[?12l[?25h[?12;25h[37;35H[?25l[30m[48;5;250m2[39;49m[25;23H[?12l[?25h[?12;25h		[C[C[C[C[C[C		[C[C[C[C[?25l+];[?12l[?25h[?12;25h[?25l ];[?12l[?25h[?12;25h[?25l];[K[?12l[?25h[?12;25h[?25l];[K[?12l[?25h[?12;25h[?25l ];[?12l[?25h[?12;25h[?25l+];[?12l[?25h[?12;25h[?25l ];[?12l[?25h[?12;25h[?25l1];[?12l[?25h[?12;25h[38;1H[?25lSaving file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c...[25;41H[?12l[?25h[?12;25h[38;1H[?25lWrote /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[25;41H[?12l[?25h[?12;25h[37;6H[?25l[30m[48;5;250m--[39;49m[25;41H[?12l[?25h[?12;25h[38;1H[K[25;41H[?25lx];[37;6H[30m[48;5;250m**[39;49m[25;42H[?12l[?25h[?12;25h[?25l];[K[?12l[?25h[?12;25h[38;1H[?25l[38;5;20mSave file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c? (y, n, !, ., q, C-r, C-f, d or C-h) [39;49m	[?12l[?25h[?12;25h[?25lSave file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c? (y, n, !, ., q, C-r, C-f, d or C-h) C-x[C[?12l[?25h[?12;25h[?25lType C-h for help.[K[25;41H[?12l[?25h[?12;25h[38;1H[?25l[38;5;20mSave file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c? (y, n, !, ., q, C-r, C-f, d or C-h) [39;49m	[?12l[?25h[?12;25h[?25lSave file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c? (y, n, !, ., q, C-r, C-f, d or C-h) C-s[C[?12l[?25h[?12;25h[?25lType C-h for help.[K[25;41H[?12l[?25h[?12;25h[38;1H[?25l[38;5;20mSave file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c? (y, n, !, ., q, C-r, C-f, d or C-h) [39;49m	[?12l[?25h[?12;25h[?25lSave file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c? (y, n, !, ., q, C-r, C-f, d or C-h) C-x[C[?12l[?25h[?12;25h[?25lType C-h for help.[K[25;41H[?12l[?25h[?12;25h[38;1H[?25l[38;5;20mSave file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c? (y, n, !, ., q, C-r, C-f, d or C-h) [39;49m	[?12l[?25h[?12;25h[?25lSave file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c? (y, n, !, ., q, C-r, C-f, d or C-h) C-s[C[?12l[?25h[?12;25h[?25lType C-h for help.[K[25;41H[?12l[?25h[?12;25h[38;1H[?25l[38;5;20mSave file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c? (y, n, !, ., q, C-r, C-f, d or C-h) [39;49m	[?12l[?25h[?12;25h[?25lSave file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c? (y, n, !, ., q, C-r, C-f, d or C-h) y	[?12l[?25h[?12;25h[38;4H[?25ling file /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c...[K[25;41H[?12l[?25h[?12;25h[38;1H[?25lWrote /home/epotapo1/i220a/submit/lab2/exercises/2-hello-upcase-args/hello.c[K[25;41H[?12l[?25h[?12;25h[38;1H[K[25;41H[38;1H[K[?1004l[?2004l[?1l>[?12l[?25h[?1049l[23;0;0t[39;49mepotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ make
cc -g -Wall -std=c18    hello.c   -o hello
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ makeemacs hello.c[4Pgdb hello./hello 'liz potapova' 'susan susan'
Hello Liz Potapova
Hello Susan Susan
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ ./hello 'liz potapova' 'susan susan'[C[C[C[C[C[C[C[C[1@ [1@t[1@h[1@ [1@t[1P[1P[1@e[1@ [1@t[1@h[1@i[1@r[1@d[C[C[C[C[C[C[C[C[C[C[C[C[C[C 's'm'e'l'l'y'p'a'n't's'
Hello Liz Potapova The Third
Hello Susan Susan Smellypants
epotapo1@remote00:~/i220a/submit/lab2/exercises/2-hello-upcase-args$ cd.[K ..
epotapo1@remote00:~/i220a/submit/lab2/exercises$ cd ..
epotapo1@remote00:~/i220a/submit/lab2$ exit

Script done on 2021-09-09 12:29:52-04:00 [COMMAND_EXIT_CODE="0"]
